trade/src/InformationRegisters/ЗаказыТорговыхПлощадок/ЗаказыТорговыхПлощадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаказыТорговыхПлощадок</name>
  <resources>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиМаркетплейсов</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаказовТорговыхПлощадок</types>
    </type>
  </resources>
  <resources>
    <name>СрокОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СрокДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторСкладаТорговойПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаУстановкиСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРодительскогоОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСкладаТорговойПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаполнениеСведенийПоТоварам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПолучениеЭтикеток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияПолученияЭтикеток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Enums/СтатусыЗаказовТорговыхПлощадок/СтатусыЗаказовТорговыхПлощадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовТорговыхПлощадок</name>
  <enumValues>
    <name>ОжидаетСборки</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ПередаетсяВДоставку</name>
  </enumValues>
  <enumValues>
    <name>ПринимаетсяВДоставку</name>
  </enumValues>
  <enumValues>
    <name>НеПринятВДоставку</name>
  </enumValues>
  <enumValues>
    <name>Спор</name>
  </enumValues>
  <enumValues>
    <name>Доставляется</name>
  </enumValues>
  <enumValues>
    <name>ВПунктеВыдачи</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Возвращен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/ТипыДокументовEDI/ТипыДокументовEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовEDI</name>
  <enumValues>
    <name>ЗаказКлиента</name>
  </enumValues>
  <enumValues>
    <name>ЗаказПоставщику</name>
  </enumValues>
</mdclass:Enum>

trade/src/Enums/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовКлиентов</name>
  <enumValues>
    <name>ОжидаетсяСогласование</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяАвансДоОбеспечения</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПредоплатаДоОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОбеспечение</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПроцессеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОплатаПослеОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ГотовКЗакрытию</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

trade/src/Catalogs/УчетныеЗаписиМаркетплейсов/УчетныеЗаписиМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиМаркетплейсов</name>
  <attributes>
    <name>ВидМаркетплейса</name>
    <type>
      <types>EnumRef.ВидыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникКатегории</name>
    <type>
      <types>EnumRef.ИсточникиКатегорийДляМаркетплейса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОбновлятьДанныеТорговойПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажиЧерезСкладыТорговойПлощадки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПродажиЧерезСкладыСобственные</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАккаунта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СхемаРаботы</name>
    <type>
      <types>EnumRef.СхемыРаботыТорговыхПлощадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКабинета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ИмяНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНастройки</name>
    <attributes>
      <name>ИдентификаторНастройки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройки</name>
      <type>
        <types>Boolean</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройкиСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеНастройкиСсылка</name>
      <comment>Состав типов реквизита дополняется по мере необходимости</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.ПричиныОтменыЗаказовКлиентов</types>
        <types>CatalogRef.СоглашенияСКлиентами</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Партнеры</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/InformationRegisters/ЗаказыТорговыхПлощадок/Forms/ФормаСпискаЗаказов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если ЗначениеЗаполнено(Параметры.ЗаголовокФормы) Тогда
		Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;

	ИспользоватьПричиныОтменыЗаказовКлиентов = ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовКлиентов");
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	
	УчетнаяЗапись = Параметры.УчетнаяЗапись;
	ДанныеТорговойПлощадки = ДанныеПоТорговойПлощадке(УчетнаяЗапись);
	
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ЗаполнитьЗначенияСвойств(СвойстваСписка, Список);
	СвойстваСписка.ТекстЗапроса =
		РегистрыСведений.ЗаказыТорговыхПлощадок.ТекстЗапросаДинамическогоСписка();
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СтатусыЗаказовВДоставке",
		Перечисления.СтатусыЗаказовТорговыхПлощадок.СтатусыЗаказовВДоставке());
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СтатусыЗаказовРаботе",
		Перечисления.СтатусыЗаказовТорговыхПлощадок.СтатусыЗаказовРаботе(Истина,, Истина));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СтатусыЗаказовКонечные",
		Перечисления.СтатусыЗаказовТорговыхПлощадок.СтатусыЗаказовКонечные());
	
	ОтборыСписковКлиентСервер.ЗаполнитьСписокВыбораОтбораПоАктуальности(Элементы.ОтборСрокВыполнения.СписокВыбора);
	ИндексЭлемента = Элементы.ОтборСрокВыполнения.СписокВыбора.Количество() - 1;
	Элементы.ОтборСрокВыполнения.СписокВыбора.Вставить(ИндексЭлемента, "НаЭтойНеделе", НСтр("ru = 'На этой неделе'"));
	ОтборыСписковКлиентСервер.ОтборПоАктуальностиПриСозданииНаСервере(
		Список,
		Актуальность,
		Элементы.ОтборСрокВыполнения.СписокВыбора,
		ДатаСобытия,
		СтруктураБыстрогоОтбора);
	
	Если ОтборыСписковКлиентСервер.НеобходимОтборПоСостояниюПриСозданииНаСервере(Состояние, СтруктураБыстрогоОтбора) Тогда
		УстановитьОтборПоСостояниюСервер();
	КонецЕсли;
	
	Перечисления.СтатусыЗаказовТорговыхПлощадок.ЗаполнитьСписокВыбора(Элементы.ОтборСтатус.СписокВыбора, Ложь);
	
	ЗаполнитьСписокВыбораОтбораПоСостояниюСервер(Элементы.ОтборСостояние.СписокВыбора);
	
	ИспользоватьРеализациюПоНесколькимЗаказам           = ПолучитьФункциональнуюОпцию("ИспользоватьРеализациюПоНесколькимЗаказам");
	ИспользоватьАктыВыполненныхРаботПоНесколькимЗаказам = ПолучитьФункциональнуюОпцию("ИспользоватьАктыВыполненныхРаботПоНесколькимЗаказам");
	ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента        = ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
	ИспользоватьОрдернуюСхемуПриОтгрузке                = ПолучитьФункциональнуюОпцию("ИспользоватьОрдернуюСхемуПриОтгрузке");
	
	УстановитьВидимостьЭлементов();
	
	Если НЕ ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента Тогда
		Элементы.УстановитьСтатусКВыполнению.Заголовок = НСтр("ru='В резерве'");
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ИспользуемыеТипыДокументов = Новый Массив;
	ИспользуемыеТипыДокументов.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКомандыСпискаОсновные;
	ПараметрыРазмещения.Источники = Новый ОписаниеТипов(ИспользуемыеТипыДокументов);
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаГлобальныеКоманды);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыПриСозданииНаСервере = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСписка();
	ПараметрыПриСозданииНаСервере.Форма = ЭтотОбъект;
	ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд = Элементы.ПодменюЭДО; // ГруппаФормы
	ПараметрыПриСозданииНаСервере.КолонкаСостоянияЭДО = Элементы.ПредставлениеСостояния;
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаСписка(ПараметрыПриСозданииНаСервере);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// ЭлектронноеВзаимодействие.СервисEDI
	ПараметрыИнтеграцииEDI = ДокументыEDIИнтеграция.ПараметрыФормыСпискаПрикладногоДокументаEDI();
	ПараметрыИнтеграцииEDI.ИмяРеквизитаСписок                                          = "Список";
	ПараметрыИнтеграцииEDI.ТипДокумента                                                = Тип("ДокументСсылка.ЗаказКлиента");
	ПараметрыИнтеграцииEDI.ИмяГруппыРазмещенияЭлементаБыстрогоОтбора                   = "ГруппаБыстрыеОтборы";
	ПараметрыИнтеграцииEDI.ИмяПсевдонимаОсновнойТаблицы                                = "ДокументЗаказКлиента";
	ПараметрыИнтеграцииEDI.СостояниеEDIРазмещатьПередЭлементом                         = "СписокУчетнаяЗапись";
	ПараметрыИнтеграцииEDI.ИмяЭлементаФормыСписок                                      = "Список";
	ПараметрыИнтеграцииEDI.ОтображатьПереходВСписокДокументыКЗагрузке                  = Истина;
	ПараметрыИнтеграцииEDI.ИмяГруппыРазмещенияЭлементаПереходВСписокДокументыКЗагрузке = "ГруппаСмотриТакжеПодвал";
	
	ДокументыEDIИнтеграция.ФормаСпискаПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка, ПараметрыИнтеграцииEDI);
	// Конец ЭлектронноеВзаимодействие.СервисEDI
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	НавигационнаяСсылка = "";

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОценкаПроизводительностиКлиент.ЗамерВремени(
		"РегистрСведений.ЗаказыТорговыхПлощадок.ПриОткрытии");
	
	УстановитьОтборПоУчетнойЗаписи();
	УстановитьОтборПоСтатусу();
	ИзменитьОтборСтрогоПоДатеСобытия();
	УстановитьДатуАктуальности();
	
	ИзменитьЛоготип();
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// ЭлектронноеВзаимодействие.СервисEDI
	ПодключитьОбработчикОжидания("ОбновлениеИнформацииEDI", 300);
	// Конец ЭлектронноеВзаимодействие.СервисEDI
	
	ЗаполнитьСведенияПоЗаказамИОтправлениям(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()

	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "МП_ОбновлениеСведенийПоЗаказамИОтправлениям"
			Или ИмяСобытия = "Запись_ЗаказКлиента"
			Или ИмяСобытия = "Запись_ПередачаТоваровХранителю"
			Или ИмяСобытия = "Запись_РеализацияТоваровУслуг" Тогда
		Элементы.Список.Обновить();
		
	ИначеЕсли (ИмяСобытия = "МП_ВыполненаЗагрузкаЗаказовТорговойПлощадки"
					Или ИмяСобытия = "МП_ВыполненаОтменаСборкиЗаказовНаТорговойПлощадке"
					Или ИмяСобытия = "МП_ВыполненоПодтверждениеСборкиЗаказовНаТорговойПлощадке"
					Или ИмяСобытия = "МП_ВыполненоОткрытиеСпораНаТорговойПлощадке"
					Или ИмяСобытия = "МП_ВыполненВозвратКОтгрузкеНаТорговойПлощадке")
				И Параметр = УчетнаяЗапись Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ПараметрыОповещения = Новый Структура("ИмяСобытия", ИмяСобытия);
			Оповещение = Новый ОписаниеОповещения("ОбработкаОповещенияЗавершение", ЭтотОбъект, ПараметрыОповещения);
			ОбработатьШтрихкоды(Оповещение, МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСписка();
	ПараметрыОповещенияЭДО.Форма = ЭтотОбъект;
	ПараметрыОповещенияЭДО.ИмяДинамическогоСписка = "Список";
	ПараметрыОповещенияЭДО.ЕстьОбработчикОбновленияВидимостиСостоянияЭДО = Истина;
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСписка(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// ЭлектронноеВзаимодействие.СервисEDI
	ДокументыEDIИнтеграцияКлиент.ОбработкаОповещенияФормаСписка(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ЭлектронноеВзаимодействие.СервисEDI
	
	ОбработкаОповещенияФрагмент(ИмяСобытия);
	
	Если ИмяСобытия = "Запись_ЗаказКлиента"
			Или ИмяСобытия = "ЗакрытиеЗаказов" Тогда
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант"
				И (Источник = "ИспользоватьЗаказыКлиентов"
					Или Источник = "ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		УстановитьВидимостьЭлементов();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	ОтборыСписковКлиентСервер.ОтборПоАктуальностиПриЗагрузкеИзНастроек(
		Список,
		Актуальность,
		Элементы.ОтборСрокВыполнения.СписокВыбора,
		ДатаСобытия,
		СтруктураБыстрогоОтбора,
		Настройки);
	
	Если ОтборыСписковКлиентСервер.НеобходимОтборПоСостояниюПриЗагрузкеИзНастроек(Состояние, СтруктураБыстрогоОтбора, Настройки) Тогда
		УстановитьОтборПоСостояниюСервер();
	КонецЕсли;
	
	// ЭлектронноеВзаимодействие.СервисEDI
	ДокументыEDIИнтеграция.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	// Конец ЭлектронноеВзаимодействие.СервисEDI

КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)

	// ЭлектронноеВзаимодействие.СервисEDI
	ДокументыEDIИнтеграция.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	// Конец ЭлектронноеВзаимодействие.СервисEDI

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборУчетнаяЗаписьПриИзменении(Элемент)

	ДанныеТорговойПлощадки = ДанныеПоТорговойПлощадке(УчетнаяЗапись);
	УстановитьОтборПоУчетнойЗаписи();
	ЗаполнитьСведенияПоЗаказамИОтправлениям(Истина);
	
	ИзменитьЛоготип();

КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)

	УстановитьОтборПоСтатусу();

КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)

	УстановитьОтборПоСостояниюСервер();

КонецПроцедуры

&НаКлиенте
Процедура ОтборСрокВыполненияПриИзменении(Элемент)

	ОтборыСписковКлиентСервер.ПриИзмененииОтбораПоАктуальности(
		Список,
		Актуальность,
		ДатаСобытия,
		Элементы.ОтборСрокВыполнения.СписокВыбора);
	ИзменитьОтборСтрогоПоДатеСобытия();
	УстановитьДатуАктуальности();

КонецПроцедуры

&НаКлиенте
Процедура ОтборСрокВыполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ОбщегоНазначенияУТКлиент.ПриВыбореОтбораПоАктуальности(
		ВыбранноеЗначение,
		СтандартнаяОбработка,
		ЭтотОбъект,
		Список,
		"Актуальность",
		"ОтборСрокВыполнения",
		"ДатаСобытия");

КонецПроцедуры

&НаКлиенте
Процедура ОтборСрокВыполненияОчистка(Элемент, СтандартнаяОбработка)

	ОтборыСписковКлиентСервер.ПриОчисткеОтбораПоАктуальности(Список, Актуальность, ДатаСобытия, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеОчистка(Элемент, СтандартнаяОбработка)

	Если Состояние = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладТорговойПлощадкиПриИзменении(Элемент)

	УстановитьОтборПоСкладу();

КонецПроцедуры

&НаКлиенте
Процедура ЗаказыНаOzonНажатие(Элемент)

	ОчиститьСообщения();
	
	ИмяОткрываемойФормы = "Обработка.УправлениеПродажамиНаOzon.Форма.СписокЗаказов";
	
	ЗаголовокФормы = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Заказы, отгружаемые со складов продавца <%1>'"), ДанныеТорговойПлощадки.ПостфиксЗаголовкаФормы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчетнаяЗапись",               УчетнаяЗапись);
	ПараметрыФормы.Вставить("ЗаголовокФормы",              ЗаголовокФормы);
	ПараметрыФормы.Вставить("ЭтоFBO",                      Ложь);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "FBS" + ДанныеТорговойПлощадки.ИдентификаторКлиента);
	
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,, "FBS");

КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаЖурналПродажиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
			СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ИмяОткрываемойФормы = "Обработка.ЖурналДокументовПродажи.Форма.СписокДокументов";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УникальныйИдентификаторФормы", Ложь);
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("ДанныеТорговойПлощадки", ДанныеТорговойПлощадки);
	ДополнительныеСвойства.Вставить("КлючНазначенияФормы",    "РаботаСПродажамиМП");
	
	ИнтеграцияСМаркетплейсамиКлиент.ДополнитьПараметрыФормы(
		ПараметрыФормы,
		ДополнительныеСвойства,
		ИмяОткрываемойФормы);
	
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы,, ПараметрыФормы.УникальныйИдентификаторФормы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)

	ОбеспечениеВДокументахКлиент.СписокПриИзменении(ЭтотОбъект, "Документ.ЗаказКлиента");

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ОчиститьСообщения();
	
	СтандартнаяОбработка = Ложь;
	ПоказатьСодержимоеТекущейЯчейки(Поле);

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	ПоказатьСодержимоеТекущейЯчейки(Элемент.ТекущийЭлемент);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

	// ЭлектронноеВзаимодействие.СервисEDI
	ДокументыEDIИнтеграция.ПриПолученииДанныхНаСервереСписокДокументов(
		Перечисления.ТипыДокументовEDI.ЗаказКлиента,
		ИмяЭлемента,
		Настройки,
		Строки);
	// Конец ЭлектронноеВзаимодействие.СервисEDI

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)

	УстановитьДатуАктуальности();
	ЗаполнитьСведенияПоЗаказамИОтправлениям();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусКВыполнению(Команда)

	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента Тогда
		ЗаголовокСтатуса = НСтр("ru='К выполнению'");
	Иначе
		ЗаголовокСтатуса = НСтр("ru='В резерве'");
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='У выделенных в списке заказов будет установлен статус ""%ИмяСтатуса%"". Продолжить?'");
	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%ИмяСтатуса%", ЗаголовокСтатуса);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВыделенныеСтроки",ВыделенныеСтроки);
	ДопПараметры.Вставить("СтатусДокументов", "КОбеспечению");
	ДопПараметры.Вставить("ЗаголовокСтатуса", ЗаголовокСтатуса);
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСтатусДокументовЗавершение", ЭтотОбъект, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусКОтгрузке(Команда)

	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru='У выделенных в списке заказов будет установлен статус ""К отгрузке"". Продолжить?'");
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВыделенныеСтроки",ВыделенныеСтроки);
	ДопПараметры.Вставить("СтатусДокументов", "КОтгрузке");
	ДопПараметры.Вставить("ЗаголовокСтатуса", НСтр("ru='К отгрузке'"));
	ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьСтатусДокументовЗавершение", ЭтотОбъект, ДопПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусЗакрыт(Команда)

	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеЗаказы = ВыделенныеЗаказы(ВыделенныеСтроки);
	
	СтруктураЗакрытия = Новый Структура;
	СписокЗаказов = Новый СписокЗначений;
	СписокЗаказов.ЗагрузитьЗначения(ВыделенныеЗаказы);
	СтруктураЗакрытия.Вставить("Заказы",                       СписокЗаказов);
	СтруктураЗакрытия.Вставить("ОтменитьНеотработанныеСтроки", Истина);
	СтруктураЗакрытия.Вставить("ЗакрыватьЗаказы",              Истина);
	
	ОткрытьФорму("Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия", СтруктураЗакрытия,
		ЭтотОбъект,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуУдаленияДокумента(Команда)

	ТипСписка = НСтр("ru = 'Заказы клиентов'");
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	
	Результат = ОбщегоНазначенияУТВызовСервера.СсылкиОбъектовПомеченныхНаУдаление(ВыделенныеСтроки, "Заказ");
	
	МассивСсылок = Результат.МассивСсылок;
	ЕстьСтрокиПомеченныеНаУдаление = Результат.ЕстьСтрокиПомеченныеНаУдаление;
	
	ТекстВопроса = ?(Результат.ЕстьСтрокиПомеченныеНаУдаление,
		НСтр("ru='Снять с выделенных элементов пометку на удаление?'"),
		НСтр("ru='Пометить выделенные элементы на удаление?'"));
	
	ПараметрыОбновленияСписка = Новый Структура;
	ПараметрыОбновленияСписка.Вставить("Форма", ЭтотОбъект);
	ПараметрыОбновленияСписка.Вставить("ИмяСписка", "Список");
	ПараметрыОбновленияСписка.Вставить("ОбновитьСписок", Истина);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Список", Элементы.Список);
	ДополнительныеПараметры.Вставить("ТипСписка", ТипСписка);
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", МассивСсылок);
	ДополнительныеПараметры.Вставить("УстановкаПометкиУдаления", Не ЕстьСтрокиПомеченныеНаУдаление);
	ДополнительныеПараметры.Вставить("ОповещениеОЗавершении", Неопределено);
	ДополнительныеПараметры.Вставить("ПараметрыОбновленияСписка", ПараметрыОбновленияСписка);
	
	Оповещение = Новый ОписаниеОповещения(
		"УстановитьПометкуУдаленияЗавершение",
		ОбщегоНазначенияУТКлиент,
		ДополнительныеПараметры);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)

	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
		Команда,
		ЭтотОбъект,
		Элементы.Список);

КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)

	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)

	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);

КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт

	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);

КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ЭлектронноеВзаимодействие.ОбменСКонтрагентами

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Элементы.Список);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьВидимостьСостоянияЭДО()

	ОбменСКонтрагентамиКлиент.ОбработчикОбновленияВидимостьСостоянияЭДО(ЭтотОбъект, Элементы.ПредставлениеСостояния);

КонецПроцедуры

// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

&НаКлиенте
Процедура ПолучитьНастройкуКомплектаДокументов(Команда)

	КлючОбъекта = "Обработка.ЖурналДокументовПродажи.Форма.КОформлениюНакладных/ТекущиеДанные";
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьНастройкуКомплектаДокументовЗавершение", ЭтотОбъект, КлючОбъекта);
	
	ПараметрыФормы = ПродажиВызовСервера.ПолучитьНастройкуКомплектаДокументов(КлючОбъекта);
	ОткрытьФорму("Обработка.ЖурналДокументовПродажи.Форма.ПараметрыОформленияДокументовПродажи",
		ПараметрыФормы,
		ЭтотОбъект,
		,,,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	// Условное оформление динамического списка "Список"
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	// Документ имеет высокий приоритет
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Документ имеет высокий приоритет'");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Приоритет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьВысшийПриоритет();
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ВысокийПриоритетДокумента);
	
	// Документ имеет низкий приоритет
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Документ имеет низкий приоритет'");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Приоритет");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Справочники.Приоритеты.ПолучитьНизшийПриоритет();
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.НизкийПриоритетДокумента);
	
	СписокКонечныхСтатусов = Перечисления.СтатусыЗаказовТорговыхПлощадок.СтатусыЗаказовКонечные();
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		// Выделение цветом состояния "Закрыт"
		ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Представление = НСтр("ru = 'Выделение цветом состояния ""Закрыт""'");
		
		ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Состояние");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;
		
		ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборЭлемента.ПравоеЗначение = СписокКонечныхСтатусов;
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	КонецЕсли;
	
	// Представление даты сборки в прошлом.
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Представление даты отгрузки - в прошлом'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=D");
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
	// Представление даты отгрузки сегодня.
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Представление даты отгрузки - сегодня'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru = 'ДФ=ЧЧ:мм'"));
	
	// Представление даты отгрузки в будущем.
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Представление даты отгрузки - в будущем'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДФ='dd.MM.yyyy ЧЧ:мм'");
	
	// Выделение цветом просроченной отгрузки
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Выделение цветом просроченной отгрузки отправления'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("НомерОтправления");
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокОтгрузки");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Просрочен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	СписокСтатусовВРаботе =
		Перечисления.СтатусыЗаказовТорговыхПлощадок.СтатусыЗаказовРаботе(Истина,, Истина);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокСтатусовВРаботе;
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Просрочен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);
	
	// Выделение цветом просроченной доставки
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Выделение цветом просроченной доставки отправления'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("НомерОтправления");
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Статус");
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокДоставки");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Просрочен");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокКонечныхСтатусов;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);
	
	// Представление даты сборки в прошлом.
	ЭлементОформления = СписокУсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Представление = НСтр("ru = 'Представление даты доставки'");
	
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("СрокДоставки");
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=D");
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПоясняющийТекст);
	
	// Представление даты заказа.
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(
		ЭтотОбъект,
		"Список.ДатаЗаказа",
		Элементы.СписокДатаЗаказа.Имя);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПоТорговойПлощадке(УчетнаяЗапись)

	// Заполнить данные из настроек интеграции.
	ДанныеТорговойПлощадки = Справочники.УчетныеЗаписиМаркетплейсов.НастройкиУчетнойЗаписи(УчетнаяЗапись);
	
	Возврат ДанныеТорговойПлощадки;

КонецФункции

&НаКлиенте
Процедура ИзменитьЛоготип()

	Элементы.ГиперссылкаЗаказыНаТорговойПлощадке.Картинка =
		ИнтеграцияСМаркетплейсамиКлиентСервер.ЛоготипТорговойПлощадки(ДанныеТорговойПлощадки.ВидМаркетплейса);

КонецПроцедуры

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)

	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаказКлиента.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);

КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкоды(Знач Оповещение, Данные)

	Если Не ШтрихкодированиеНоменклатурыКлиент.ШтрихкодыВалидны(Данные) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если МассивСсылок.Количество() > 0 Тогда
		Ссылка = МассивСсылок[0];
		Элементы.Список.ТекущаяСтрока = Ссылка;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьШтрихкодыЗавершение",
			ЭтотОбъект,
			Новый Структура("Данные, Оповещение", Данные, Оповещение));
		ПоказатьЗначение(ОписаниеОповещения, Ссылка);
		Возврат;
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
	ОбработатьШтрихкодыФрагмент(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодыЗавершение(ДополнительныеПараметры) Экспорт

	Оповещение = ДополнительныеПараметры.Оповещение;
	
	ОбработатьШтрихкодыФрагмент(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкодыФрагмент(Знач Оповещение)

	ВыполнитьОбработкуОповещения(Оповещение);

КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура ПоказатьСодержимоеТекущейЯчейки(Поле)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОтгрузки)
			И (Поле.Имя = "СписокНомерОтправления"
				Или Поле.Имя = "СписокСтатус"
				Или Поле.Имя = "СписокДокументОтгрузки"
				Или Поле.Имя = "СуммаДокументаОтгрузки") Тогда
		ПоказатьЗначение(, ТекущиеДанные.ДокументОтгрузки);
		
	ИначеЕсли Поле.Имя = "СписокПроцентОтгрузки" Или Поле.Имя = "СписокСостояние" Тогда
		СписокДокументов = Новый СписокЗначений;
		СписокДокументов.Добавить(ТекущиеДанные.Ссылка);
		
		Если ТекущиеДанные.ЭтоЗаказКакСчет Тогда
			Возврат;
		КонецЕсли;
		
		ОткрытьФорму("Отчет.СостояниеВыполненияДокументов.Форма.ФормаОтчета",
			Новый Структура("ВходящиеДокументы", СписокДокументов),
			ЭтотОбъект,
			Ложь);
		
	ИначеЕсли Поле.Имя = "СписокКартинкаДоставки" Или Поле.Имя = "СписокИдентификаторОтгрузки" Тогда
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторОтгрузки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет данных об отгрузке.'"));
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		ПараметрыФормы.Вставить("ИдентификаторОтгрузки", ТекущиеДанные.ИдентификаторОтгрузки);
		ПараметрыФормы.Вставить("ИдентификаторСклада",   ТекущиеДанные.ИдентификаторСкладаТорговойПлощадки);
		ПараметрыФормы.Вставить("СписокСкладов",         Элементы.ОтборСкладТорговойПлощадки.СписокВыбора);
		ПараметрыФормы.Вставить("СписокМетодовДоставки", СписокМетодовДоставки);
		
		ОткрытьФорму("РегистрСведений.ЗаказыТорговыхПлощадок.Форма.ПодготовкаОтгрузки", ПараметрыФормы, ЭтотОбъект);
	Иначе
		ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоУчетнойЗаписи()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"УчетнаяЗапись",
		УчетнаяЗапись,
		,
		,
		ЗначениеЗаполнено(УчетнаяЗапись));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСтатусу()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"Статус",
		ОтборСтатус,
		,
		,
		ЗначениеЗаполнено(ОтборСтатус));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуАктуальности()

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ДатаАктуальности",
		ОбщегоНазначенияКлиент.ДатаСеанса());
	ПодключитьОбработчикОжидания("УстановитьДатуАктуальности", 10*60, Истина);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияРаспределенияЗапасовПоЗаказам()

	ОбеспечениеВДокументахКлиент.ПроверитьВыполнениеЗаданияРаспределенияЗапасовПоЗаказам(ЭтотОбъект, Элементы.Список);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораОтбораПоСостояниюСервер(СписокВыбора)

	СписокВыбора.Добавить("ВсеОткрытые", НСтр("ru='Все открытые'"));
	СписокВыбора.Добавить("ВсеОжидающиеИсполнения", НСтр("ru='Все ожидающие исполнения'"));
	
	СписокВыбора.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКОбеспечению);
	СписокВыбора.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОбеспечение);
	СписокВыбора.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКОтгрузке);
	СписокВыбора.Добавить(Перечисления.СостоянияЗаказовКлиентов.ВПроцессеОтгрузки);
	Если ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыКлиентовБезПолнойОплаты") 
		ИЛИ ПолучитьФункциональнуюОпцию("НеЗакрыватьЗаказыКлиентовБезПолнойОтгрузки") Тогда
		СписокВыбора.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКЗакрытию);
	КонецЕсли;
	СписокВыбора.Добавить(Перечисления.СостоянияЗаказовКлиентов.Закрыт);

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоСостояниюСервер()

	Если Состояние = "ВсеОткрытые" Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние",
			Перечисления.СостоянияЗаказовКлиентов.Закрыт, ВидСравненияКомпоновкиДанных.НеРавно,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления",
			Ложь,,, Истина);
		
	ИначеЕсли Состояние = "ВсеОжидающиеОплаты" Тогда
		
		МассивСостояний = Новый Массив();
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяАвансДоОбеспечения);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяПредоплатаДоОтгрузки);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние",
			МассивСостояний, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления",
			Ложь,,, Истина);
		
	ИначеЕсли Состояние = "ВсеОжидающиеИсполнения" Тогда
		
		МассивСостояний = Новый Массив();
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяСогласование);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКОбеспечению);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОбеспечение);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКОтгрузке);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ВПроцессеОтгрузки);
		МассивСостояний.Добавить(Перечисления.СостоянияЗаказовКлиентов.ГотовКЗакрытию);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние",
			МассивСостояний, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления",
			Ложь,,, Истина);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Состояние",
			Состояние, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Состояние));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления",
			,,, Ложь);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()

	ЕстьДоступНаИзменение = ПравоДоступа("Изменение", Метаданные.Документы.ЗаказКлиента);
	ИспользоватьЗаказыКлиентов                      = ПолучитьФункциональнуюОпцию("ИспользоватьЗаказыКлиентов");
	ИспользоватьРасширенныеВозможностиЗаказаКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента    = ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
	
	Элементы.УстановитьСтатусКОтгрузке.Видимость = ИспользоватьРасширенныеВозможностиЗаказаКлиента
													И Не ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента;
	
	Элементы.СписокСуммаОтгрузки.Видимость           = ИспользоватьРасширенныеВозможностиЗаказаКлиента;
	Элементы.СписокПроцентОтгрузки.Видимость         = ИспользоватьРасширенныеВозможностиЗаказаКлиента;
	Элементы.СписокСостояние.Видимость               = ИспользоватьРасширенныеВозможностиЗаказаКлиента;
	Элементы.ЕстьРасхожденияОрдерНакладная.Видимость = ИспользоватьРасширенныеВозможностиЗаказаКлиента;
	
	Элементы.УстановитьСтатусЗакрыт.Видимость        = ПравоДоступа("Изменение",Метаданные.Документы.ЗаказКлиента);
	
	КомандыОбеспеченияВидимы = ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента И ЕстьДоступНаИзменение;
	Элементы.СписокОтгрузитьЗаказ.Видимость                      = КомандыОбеспеченияВидимы;
	Элементы.СписокРезервироватьЗаказ.Видимость                  = КомандыОбеспеченияВидимы;
	Элементы.СписокКОбеспечениюЗаказ.Видимость                   = КомандыОбеспеченияВидимы;
	Элементы.СписокРезервироватьПоМереПоступленияЗаказ.Видимость = КомандыОбеспеченияВидимы;
	Элементы.СписокНеОбеспечиватьЗаказ.Видимость                 = КомандыОбеспеченияВидимы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СписокСостояниеОбеспеченияСпискаЗаказов",
		"Видимость",
		ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента);
	
	ДоступностьКоманд = ИспользоватьЗаказыКлиентов И ИспользоватьРасширенныеВозможностиЗаказаКлиента;
	
	Элементы.ЗагрузитьНовыеЗаказы.Доступность                  = ДоступностьКоманд;
	Элементы.ГруппаКомандыОбработкиДокументов.Доступность      = ДоступностьКоманд;
	Элементы.ГруппаКомандыИзмененияСтатусов.Доступность        = ДоступностьКоманд;
	Элементы.ГруппаКомандыРаботыСоСпорнымиЗаказами.Доступность = ДоступностьКоманд;
	Элементы.СписокПечатьЭтикеток.Доступность                  = ДоступностьКоманд;
	
	Элементы.КонтекстноеМенюЗагрузитьЗаказы.Доступность                       = ДоступностьКоманд;
	Элементы.КонтекстноеМенюГруппаКомандыОбработкиДокументов.Доступность      = ДоступностьКоманд;
	Элементы.КонтекстноеМенюГруппаКомандыИзмененияСтатусов.Доступность        = ДоступностьКоманд;
	Элементы.КонтекстноеМенюГруппаКомандыРаботыСоСпорнымиЗаказами.Доступность = ДоступностьКоманд;
	Элементы.КонтекстноеМенюПечатьЭтикеток.Доступность                        = ДоступностьКоманд;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСведенияПоЗаказамИОтправлениям(ЗаполнитьСписокСкладов = Ложь)

	ОчиститьСообщения();
	
	Элементы.КартинкаДлительноеОжиданиеРасширеннаяПодсказка.Ширина = 0;
	Элементы.СтраницыСостояния.ТекущаяСтраница = Элементы.ГруппаЗаполнениеВыполняется;
	
	Если ЗаполнитьСписокСкладов Тогда
		Элементы.ОтборСкладТорговойПлощадки.СписокВыбора.Очистить();
		Элементы.ОтборСкладТорговойПлощадки.СписокВыбора.Добавить("", НСтр("ru = '<Заполнение списка...>'"));
		
		СписокМетодовДоставки = Новый Структура;
		
		Если Не ПустаяСтрока(ОтборСкладТорговойПлощадки) Тогда
			ОтборСкладТорговойПлощадки = "";
			УстановитьОтборПоСкладу();
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Заполнение сведений по заказам и отправлениям'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ПараметрыЗавершения = Новый Структура("ЗаполнитьСписокСкладов", ЗаполнитьСписокСкладов);
	ОповещениеОЗавершении =
		Новый ОписаниеОповещения("ЗаполнениеСведенийПоЗаказамИОтправлениямЗавершение", ЭтотОбъект, ПараметрыЗавершения);
	
	ДлительнаяОперация = ЗапуститьЗаполнениеСведенийПоЗаказамИОтправлениям(
																			УчетнаяЗапись,
																			УникальныйИдентификатор,
																			ЗаполнитьСписокСкладов);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьЗаполнениеСведенийПоЗаказамИОтправлениям(УчетнаяЗапись, УникальныйИдентификатор, ЗаполнитьСписокСкладов)

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания =
		НСтр("ru = 'Интеграция с маркетплейсами. Заполнение сведений по заказам и отправлениям.'");
	
	ИмяМетода = "РегистрыСведений.ЗаказыТорговыхПлощадок.ОбновитьСведенияПоЗаказамИОтправлениям";
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода, УчетнаяЗапись, ЗаполнитьСписокСкладов);

КонецФункции

&НаКлиенте
Процедура ЗаполнениеСведенийПоЗаказамИОтправлениямЗавершение(РезультатЗадания, ДополнительныеПараметры) Экспорт

	Если ДополнительныеПараметры.ЗаполнитьСписокСкладов Тогда
		Элементы.ОтборСкладТорговойПлощадки.СписокВыбора.Очистить();
	КонецЕсли;
	
	Элементы.КартинкаДлительноеОжиданиеРасширеннаяПодсказка.Ширина = 1;
	Элементы.СтраницыСостояния.ТекущаяСтраница = Элементы.ГруппаЗаполнениеЗавершено;
	
	Если РезультатЗадания <> Неопределено
			И РезультатЗадания.Статус = "Выполнено" Тогда
		Если ДополнительныеПараметры.ЗаполнитьСписокСкладов Тогда
			Ошибка = ЗаполнитьСписокСкладовИМетодовДоставки(РезультатЗадания.АдресРезультата);
			
			ИнтеграцияСМаркетплейсамиКлиент.ВывестиСостояние(
				Ошибка,
				,
				Истина,
				Элементы.ГиперссылкаЗаказыНаТорговойПлощадке.Картинка);
		КонецЕсли;
		
	Иначе
		ШаблонОшибки = НСтр("ru = 'Не удалось заполнить сведения по заказам и отправлениям по причине: %1'");
		ПредставлениеНеизвестнойОшибки = НСтр("ru = 'Неизвестная ошибка выполнения операции'");
		ПодробноеПредставлениеОшибки = ?(РезультатЗадания = Неопределено,
			ПредставлениеНеизвестнойОшибки,
			РезультатЗадания.ПодробноеПредставлениеОшибки);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибки,
				ПодробноеПредставлениеОшибки);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	УстановитьОтборПоСкладу();
	
	Оповестить("МП_ОбновлениеСведенийПоЗаказамИОтправлениям",,);

КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокСкладовИМетодовДоставки(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если Результат = Неопределено Тогда
		Возврат ИнтеграцияСМаркетплейсамиСервер.НоваяОшибка();
	КонецЕсли;
	
	ИнтеграцияСМаркетплейсамиСервер.ЗаполнитьСписокСкладовИМетодовДоставки(
		ДанныеТорговойПлощадки.ВидМаркетплейса,
		Результат.ТаблицаСкладов,
		Элементы.ОтборСкладТорговойПлощадки.СписокВыбора,
		СписокМетодовДоставки);
	
	Возврат Результат.Ошибка;

КонецФункции

&НаКлиенте
Процедура УстановитьОтборПоСкладу()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ИдентификаторСкладаТорговойПлощадки",
		ОтборСкладТорговойПлощадки,
		,
		,
		ЗначениеЗаполнено(ОтборСкладТорговойПлощадки));

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ИмяСобытия = ДополнительныеПараметры.ИмяСобытия;
	ОбработкаОповещенияФрагмент(ИмяСобытия);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияФрагмент(Знач ИмяСобытия)

	Если ИмяСобытия = "ЗачтенаОплата"
			ИЛИ ПродажиКлиент.ИзменилисьДокументыОплатыКлиентам(ИмяСобытия)
			ИЛИ ИмяСобытия = "ЗакрытиеЗаказов" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусДокументовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	СтатусДокументов = ДополнительныеПараметры.СтатусДокументов;
	ЗаголовокСтатуса = ДополнительныеПараметры.ЗаголовокСтатуса;
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	КоличествоОбработанных = УстановитьСтатусДокументовНаСервере(ВыделенныеСтроки, СтатусДокументов);
	ОбщегоНазначенияУТКлиент.ОповеститьПользователяОбУстановкеСтатуса(
		Элементы.Список,
		КоличествоОбработанных,
		ВыделенныеСтроки.Количество(),
		ЗаголовокСтатуса);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьСтатусДокументовНаСервере(ВыделенныеСтроки, СтатусДокументов)

	МассивДокументов = ВыделенныеЗаказы(ВыделенныеСтроки);
	КоличествоОбработанных =
		ОбщегоНазначенияУТВызовСервера.УстановитьСтатусДокументов(МассивДокументов, СтатусДокументов);
	
	Возврат КоличествоОбработанных;

КонецФункции

&НаСервереБезКонтекста
Функция ВыделенныеЗаказы(ВыделенныеСтроки)

	МассивДокументов = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		МассивДокументов.Добавить(ВыделеннаяСтрока.Заказ);
	КонецЦикла;

	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивДокументов);

КонецФункции

&НаКлиенте
Процедура ИзменитьОтборСтрогоПоДатеСобытия()

	КоллекцияЭлементов = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы;
	Представление = НСтр("ru = 'Отбор по дате события'");
	ДатаНачалаСобытия = Дата(1, 1, 1);
	
	ГруппаОтбора =
		ОбщегоНазначенияКлиентСервер.НайтиЭлементОтбораПоПредставлению(КоллекцияЭлементов, Представление);
	
	Если ГруппаОтбора <> Неопределено Тогда
		Если Актуальность = "Сегодня"
				Или Актуальность = "Завтра"
				Или Актуальность = "Послезавтра" Тогда
			НовыйВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			// ДатаСобытия не изменяется.
		ИначеЕсли Актуальность = "НаЭтойНеделе" Тогда
			НовыйВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			ДатаАктуальности = ОбщегоНазначенияКлиент.ДатаСеанса();
			ДатаСобытия = КонецНедели(ОбщегоНазначенияКлиент.ДатаСеанса());
			ДатаНачалаСобытия = НачалоНедели(ДатаАктуальности);
		ИначеЕсли Актуальность = "ЧерезНеделю" Тогда
			НовыйВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			// ДатаСобытия не изменяется.
		Иначе
			Возврат;
		КонецЕсли;
		
		Для Каждого ЭлементОтбора Из ГруппаОтбора.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаСобытия")
					И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
				ЭлементОтбора.ВидСравнения = НовыйВидСравнения;
				ЭлементОтбора.ПравоеЗначение = ДатаСобытия;
				ЭлементОтбора.Использование  = Истина;
			ИначеЕсли ЗначениеЗаполнено(ДатаНачалаСобытия)
					И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаСобытия")
					И Не ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение) Тогда
				ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ЭлементОтбора.ПравоеЗначение = ДатаНачалаСобытия;
				ЭлементОтбора.Использование  = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#Область НастройкаКомплектаДокументов

&НаКлиенте
Процедура ПолучитьНастройкуКомплектаДокументовЗавершение(Результат, КлючОбъекта) Экспорт 

	Если Результат <> Неопределено Тогда
		ПродажиВызовСервера.СохранитьНастройкуКомплектаДокументов(Результат, КлючОбъекта);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

// ЭлектронноеВзаимодействие.СервисEDI

#Область EDI

&НаКлиенте
Процедура Подключаемый_СтатусEDIОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ДокументыEDIИнтеграцияКлиент.ОтборСтатусEDIОбработкаВыбора(
		ЭтотОбъект,
		Элемент,
		ВыбранноеЗначение,
		СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтатусEDIОчистка(Элемент, СтандартнаяОбработка)

	ДокументыEDIИнтеграцияКлиент.ОтборСтатусEDIОчистка(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОформляемыеДокументыEDIОбработкаНавигационнойСсылки(Элемент,
			НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	ДокументыEDIИнтеграцияКлиент.ОформляемыеДокументыEDIОбработкаНавигационнойСсылки(
		ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИнформацииEDI()

	ДокументыEDIИнтеграцияКлиент.ВыполнитьОбновлениеИнформацииСпискаДокументов(
		ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.ТипыДокументовEDI.ЗаказКлиента"));

КонецПроцедуры

#КонецОбласти

// Конец ЭлектронноеВзаимодействие.СервисEDI

#КонецОбласти
